{
  "growthCards": [
    {
      "id": 1,
      "icon": "FaLightbulb",
      "title": "Hybrid Business Model",
      "description": "Combining international market competitiveness with high-margin local SME specialization for sustainable growth and revenue stability."
    },
    {
      "id": 2,
      "icon": "FaUsers",
      "title": "SME Focused Expertise",
      "description": "Deep understanding of Pakistani SME needs, delivering professional web solutions that bridge the local digitization gap effectively."
    },
    {
      "id": 3,
      "icon": "FaCogs",
      "title": "Process Driven Delivery",
      "description": "Structured, milestone-based development workflow ensuring on-time, on-budget project delivery with complete transparency."
    },
    {
      "id": 4,
      "icon": "FaRocket",
      "title": "Scalable Solutions",
      "description": "Future-proof digital products built for long-term growth with recurring revenue services for ongoing business success."
    }
  ],
  "processSteps": [
    {
      "id": 1,
      "stepNumber": "01",
      "title": "Requirement Analysis",
      "description": "Comprehensive discovery of business needs, target market analysis, and conversion-focused goal setting for your digital solution."
    },
    {
      "id": 2,
      "stepNumber": "02",
      "title": "Milestone Planning",
      "description": "Transparent project breakdown with clear deliverables, timelines, and budget allocation using our proven hybrid development approach."
    },
    {
      "id": 3,
      "stepNumber": "03",
      "title": "Development & Integration",
      "description": "Building scalable solutions using modern stacks (MERN/WordPress) with local system integrations for Pakistani market needs."
    },
    {
      "id": 4,
      "stepNumber": "04",
      "title": "Quality Assurance",
      "description": "Rigorous testing for performance, mobile optimization, and conversion effectiveness across all devices and platforms."
    },
    {
      "id": 5,
      "stepNumber": "05",
      "title": "Launch & Growth Support",
      "description": "Smooth deployment with ongoing managed hosting, SEO, and maintenance services to ensure long-term digital success."
    }
  ]
}